; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v6 ?v9)
             (pred_4 ?v5 ?v1)
             (pred_1 ?v6 ?v1)
             (pred_8 ?v7 ?v6 )
	     (pred_2 ?v6)
             (pred_10 ?v11)
             (pred_11 ?v5)
             (pred_7 ?v1)
             (pred_6 ?v6)
             (pred_12 ?v5)
             (pred_9 ?v6)
             (pred_3 ))



(:action op_5
:parameters (?v2 ?v13 ?v3 ?v10)
:precondition (and (pred_10 ?v2) (pred_10 ?v13) (pred_11 ?v3) (pred_7 ?v10)
          (pred_5 ?v2 ?v13) (pred_4 ?v3 ?v10)
                   (pred_1 ?v13 ?v10) (pred_2 ?v2) 
                   (pred_6 ?v13) (pred_12 ?v3))
:effect (and  (pred_9 ?v13) (not (pred_6 ?v13))))


(:action op_2
:parameters (?v2 ?v8)
:precondition (and (pred_10 ?v2) (pred_10 ?v8)
               (pred_2 ?v2) (pred_5 ?v2 ?v8) (pred_9 ?v8))
:effect (and (pred_2 ?v8) (not (pred_2 ?v2))))

(:action op_4
:parameters (?v2 ?v3)
:precondition (and (pred_10 ?v2) (pred_11 ?v3) 
                  (pred_2 ?v2) (pred_8 ?v3 ?v2) (pred_3 ))
:effect (and (pred_12 ?v3)
   (not (pred_8 ?v3 ?v2)) (not (pred_3 ))))


(:action op_3
:parameters (?v2 ?v4 ?v12)
:precondition (and (pred_10 ?v2) (pred_11 ?v4) (pred_11 ?v12)
                  (pred_2 ?v2) (pred_12 ?v12) (pred_8 ?v4 ?v2))
:effect (and (pred_12 ?v4) (pred_8 ?v12 ?v2)
        (not (pred_12 ?v12)) (not (pred_8 ?v4 ?v2))))

(:action op_1
:parameters (?v2 ?v3)
:precondition (and (pred_10 ?v2) (pred_11 ?v3) 
                  (pred_2 ?v2) (pred_12 ?v3))
:effect (and (pred_3 ) (pred_8 ?v3 ?v2) (not (pred_12 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_19 obj_03 obj_12 obj_16 obj_05 obj_20 obj_09 obj_13 obj_04 obj_15 obj_01 obj_07 obj_10 obj_14 obj_08
    obj_06 obj_21
    obj_17 obj_02 obj_18
    )

    (:init
       (pred_3)

       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_03)
       (pred_10 obj_12)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_04)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_14)
       (pred_10 obj_08)
       (pred_7 obj_06)
       (pred_7 obj_21)
       (pred_11 obj_17)
       (pred_11 obj_02)
       (pred_11 obj_18)

       (pred_5 obj_11 obj_16)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_03)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_03 obj_20)
       (pred_5 obj_03 obj_12)
       (pred_5 obj_03 obj_19)
       (pred_5 obj_12 obj_09)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_20 obj_15)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_20 obj_03)
       (pred_5 obj_20 obj_05)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_15)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_15 obj_14)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_15 obj_20)
       (pred_5 obj_15 obj_04)
       (pred_5 obj_01 obj_08)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_07 obj_13)
       (pred_5 obj_10 obj_14)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_14 obj_15)
       (pred_5 obj_14 obj_10)
       (pred_5 obj_08 obj_01)
       (pred_5 obj_08 obj_14)
       (pred_6 obj_20)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_1  obj_20 obj_06)
       (pred_1  obj_11 obj_21)
       (pred_1  obj_19 obj_21)
       (pred_9 obj_03)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_05)
       (pred_9 obj_09)
       (pred_9 obj_13)
       (pred_9 obj_04)
       (pred_9 obj_15)
       (pred_9 obj_01)
       (pred_9 obj_07)
       (pred_9 obj_10)
       (pred_9 obj_14)
       (pred_9 obj_08)

       (pred_4  obj_17 obj_06)
       (pred_4  obj_02 obj_21)
       (pred_4  obj_18 obj_21)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_02 obj_09)
       (pred_8 obj_18 obj_12)
       (pred_2 obj_08)
    )

    (:goal (and
       (pred_8 obj_02 obj_16)
    ))
(:constraints
  (always (not (pred_2 obj_04)))
)
)

; plan
1. (op_2 obj_08 obj_01)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_01)
   goals met: 0 of 1
2. (op_2 obj_01 obj_09)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_09)
   goals met: 0 of 1
3. (op_4 obj_09 obj_02)
   deleted: (pred_8 obj_02 obj_09) (pred_3)
   added: (pred_12 obj_02)
   goals met: 0 of 1
4. (op_2 obj_09 obj_01)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_01)
   goals met: 0 of 1
5. (op_2 obj_01 obj_15)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_15)
   goals met: 0 of 1
6. (op_2 obj_15 obj_14)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_14)
   goals met: 0 of 1
7. (op_2 obj_14 obj_10)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_10)
   goals met: 0 of 1
8. (op_2 obj_10 obj_07)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_07)
   goals met: 0 of 1
9. (op_2 obj_07 obj_13)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_13)
   goals met: 0 of 1
10. (op_2 obj_13 obj_16)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_16)
   goals met: 0 of 1
11. (op_1 obj_16 obj_02)
   deleted: (pred_12 obj_02)
   added: (pred_3) (pred_8 obj_02 obj_16)
   goals met: 1 of 1
